7767517
190 205
Input                    in0                      0 1 in0
Convolution              conv_2                   1 1 in0 1 0=16 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=432
HardSwish                hswish_59                1 1 1 2 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_142               1 1 2 3 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=144 7=16
HardSwish                hswish_60                1 1 3 4 0=1.666667e-01 1=5.000000e-01
Convolution              conv_3                   1 1 4 5 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=512
HardSwish                hswish_61                1 1 5 6 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_143               1 1 6 7 0=32 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=288 7=32
HardSwish                hswish_62                1 1 7 8 0=1.666667e-01 1=5.000000e-01
Convolution              conv_4                   1 1 8 9 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
HardSwish                hswish_63                1 1 9 10 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_144               1 1 10 11 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=576 7=64
HardSwish                hswish_64                1 1 11 12 0=1.666667e-01 1=5.000000e-01
Convolution              conv_5                   1 1 12 13 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
HardSwish                hswish_65                1 1 13 14 0=1.666667e-01 1=5.000000e-01
Split                    splitncnn_0              1 2 14 15 16
ConvolutionDepthWise     convdw_145               1 1 16 17 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=576 7=64
HardSwish                hswish_66                1 1 17 18 0=1.666667e-01 1=5.000000e-01
Convolution              conv_6                   1 1 18 19 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
HardSwish                hswish_67                1 1 19 20 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_146               1 1 20 21 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128
HardSwish                hswish_68                1 1 21 22 0=1.666667e-01 1=5.000000e-01
Convolution              conv_7                   1 1 22 23 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
HardSwish                hswish_69                1 1 23 24 0=1.666667e-01 1=5.000000e-01
Split                    splitncnn_1              1 2 24 25 26
ConvolutionDepthWise     convdw_147               1 1 26 27 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=1152 7=128
HardSwish                hswish_70                1 1 27 28 0=1.666667e-01 1=5.000000e-01
Convolution              conv_8                   1 1 28 29 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
HardSwish                hswish_71                1 1 29 30 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_148               1 1 30 31 0=256 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=6400 7=256
HardSwish                hswish_72                1 1 31 32 0=1.666667e-01 1=5.000000e-01
Convolution              conv_9                   1 1 32 33 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
HardSwish                hswish_73                1 1 33 34 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_149               1 1 34 35 0=256 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=6400 7=256
HardSwish                hswish_74                1 1 35 36 0=1.666667e-01 1=5.000000e-01
Convolution              conv_10                  1 1 36 37 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
HardSwish                hswish_75                1 1 37 38 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_150               1 1 38 39 0=256 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=6400 7=256
HardSwish                hswish_76                1 1 39 40 0=1.666667e-01 1=5.000000e-01
Convolution              conv_11                  1 1 40 41 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
HardSwish                hswish_77                1 1 41 42 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_151               1 1 42 43 0=256 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=6400 7=256
HardSwish                hswish_78                1 1 43 44 0=1.666667e-01 1=5.000000e-01
Convolution              conv_12                  1 1 44 45 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
HardSwish                hswish_79                1 1 45 46 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_152               1 1 46 47 0=256 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=6400 7=256
HardSwish                hswish_80                1 1 47 48 0=1.666667e-01 1=5.000000e-01
Convolution              conv_13                  1 1 48 49 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
HardSwish                hswish_81                1 1 49 50 0=1.666667e-01 1=5.000000e-01
Split                    splitncnn_2              1 2 50 51 52
ConvolutionDepthWise     convdw_153               1 1 52 53 0=256 1=5 11=5 12=1 13=2 14=2 2=1 3=2 4=2 5=1 6=6400 7=256
HardSwish                hswish_82                1 1 53 54 0=1.666667e-01 1=5.000000e-01
Split                    splitncnn_3              1 2 54 55 56
Pooling                  gap_0                    1 1 56 57 0=1 4=1
Convolution              convrelu_0               1 1 57 58 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=1
Convolution              conv_15                  1 1 58 59 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
HardSigmoid              hsigmoid_57              1 1 59 60 0=1.666667e-01 1=5.000000e-01
Reshape                  reshape_139              1 1 60 61 0=1 1=1 2=-1
BinaryOp                 mul_0                    2 1 55 61 62 0=2
Convolution              conv_16                  1 1 62 63 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
HardSwish                hswish_83                1 1 63 64 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_154               1 1 64 65 0=512 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=12800 7=512
HardSwish                hswish_84                1 1 65 66 0=1.666667e-01 1=5.000000e-01
Split                    splitncnn_4              1 2 66 67 68
Pooling                  gap_1                    1 1 68 69 0=1 4=1
Convolution              convrelu_1               1 1 69 70 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536 9=1
Convolution              conv_18                  1 1 70 71 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
HardSigmoid              hsigmoid_58              1 1 71 72 0=1.666667e-01 1=5.000000e-01
Reshape                  reshape_140              1 1 72 73 0=1 1=1 2=-1
BinaryOp                 mul_1                    2 1 67 73 74 0=2
Convolution              conv_19                  1 1 74 75 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
HardSwish                hswish_85                1 1 75 76 0=1.666667e-01 1=5.000000e-01
Convolution              conv_20                  1 1 15 77 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=6144
HardSwish                hswish_88                1 1 77 78 0=1.666667e-01 1=5.000000e-01
Convolution              conv_21                  1 1 25 79 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=12288
HardSwish                hswish_89                1 1 79 80 0=1.666667e-01 1=5.000000e-01
Convolution              conv_22                  1 1 51 81 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576
HardSwish                hswish_90                1 1 81 82 0=1.666667e-01 1=5.000000e-01
Convolution              conv_23                  1 1 76 83 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=49152
HardSwish                hswish_91                1 1 83 84 0=1.666667e-01 1=5.000000e-01
Split                    splitncnn_5              1 2 84 85 86
Interp                   upsample_nearest_135     1 1 86 87 0=1 3=31 4=31 6=0
Concat                   cat_0                    2 1 87 82 88 0=0
Split                    splitncnn_6              1 2 88 89 90
Convolution              conv_24                  1 1 90 91 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
HardSwish                hswish_92                1 1 91 92 0=1.666667e-01 1=5.000000e-01
Convolution              conv_25                  1 1 89 93 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
HardSwish                hswish_93                1 1 93 94 0=1.666667e-01 1=5.000000e-01
Convolution              conv_26                  1 1 94 95 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
HardSwish                hswish_94                1 1 95 96 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_155               1 1 96 97 0=48 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=1200 7=48
HardSwish                hswish_95                1 1 97 98 0=1.666667e-01 1=5.000000e-01
Convolution              conv_27                  1 1 98 99 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
HardSwish                hswish_96                1 1 99 100 0=1.666667e-01 1=5.000000e-01
Concat                   cat_1                    2 1 100 92 101 0=0
Convolution              conv_28                  1 1 101 102 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
HardSwish                hswish_97                1 1 102 103 0=1.666667e-01 1=5.000000e-01
Split                    splitncnn_7              1 2 103 104 105
Interp                   upsample_nearest_136     1 1 105 106 0=1 3=61 4=61 6=0
Concat                   cat_2                    2 1 106 80 107 0=0
Split                    splitncnn_8              1 2 107 108 109
Convolution              conv_29                  1 1 109 110 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
HardSwish                hswish_98                1 1 110 111 0=1.666667e-01 1=5.000000e-01
Convolution              conv_30                  1 1 108 112 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
HardSwish                hswish_99                1 1 112 113 0=1.666667e-01 1=5.000000e-01
Convolution              conv_31                  1 1 113 114 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
HardSwish                hswish_100               1 1 114 115 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_156               1 1 115 116 0=48 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=1200 7=48
HardSwish                hswish_101               1 1 116 117 0=1.666667e-01 1=5.000000e-01
Convolution              conv_32                  1 1 117 118 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
HardSwish                hswish_102               1 1 118 119 0=1.666667e-01 1=5.000000e-01
Concat                   cat_3                    2 1 119 111 120 0=0
Convolution              conv_33                  1 1 120 121 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
HardSwish                hswish_103               1 1 121 122 0=1.666667e-01 1=5.000000e-01
Split                    splitncnn_9              1 2 122 123 124
Interp                   upsample_nearest_137     1 1 124 125 0=1 3=122 4=122 6=0
Concat                   cat_4                    2 1 125 78 126 0=0
Split                    splitncnn_10             1 2 126 127 128
Convolution              conv_34                  1 1 128 129 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
HardSwish                hswish_104               1 1 129 130 0=1.666667e-01 1=5.000000e-01
Convolution              conv_35                  1 1 127 131 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
HardSwish                hswish_105               1 1 131 132 0=1.666667e-01 1=5.000000e-01
Convolution              conv_36                  1 1 132 133 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
HardSwish                hswish_106               1 1 133 134 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_157               1 1 134 135 0=48 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=1200 7=48
HardSwish                hswish_107               1 1 135 136 0=1.666667e-01 1=5.000000e-01
Convolution              conv_37                  1 1 136 137 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
HardSwish                hswish_108               1 1 137 138 0=1.666667e-01 1=5.000000e-01
Concat                   cat_5                    2 1 138 130 139 0=0
Convolution              conv_38                  1 1 139 140 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
HardSwish                hswish_109               1 1 140 141 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_158               1 1 141 142 0=96 1=5 11=5 12=1 13=2 14=2 2=1 3=2 4=2 5=1 6=2400 7=96
HardSwish                hswish_110               1 1 142 143 0=1.666667e-01 1=5.000000e-01
Convolution              conv_39                  1 1 143 144 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
HardSwish                hswish_111               1 1 144 145 0=1.666667e-01 1=5.000000e-01
Concat                   cat_6                    2 1 145 123 146 0=0
Split                    splitncnn_11             1 2 146 147 148
Convolution              conv_40                  1 1 148 149 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
HardSwish                hswish_112               1 1 149 150 0=1.666667e-01 1=5.000000e-01
Convolution              conv_41                  1 1 147 151 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
HardSwish                hswish_113               1 1 151 152 0=1.666667e-01 1=5.000000e-01
Convolution              conv_42                  1 1 152 153 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
HardSwish                hswish_114               1 1 153 154 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_159               1 1 154 155 0=48 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=1200 7=48
HardSwish                hswish_115               1 1 155 156 0=1.666667e-01 1=5.000000e-01
Convolution              conv_43                  1 1 156 157 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
HardSwish                hswish_116               1 1 157 158 0=1.666667e-01 1=5.000000e-01
Concat                   cat_7                    2 1 158 150 159 0=0
Convolution              conv_44                  1 1 159 160 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
HardSwish                hswish_117               1 1 160 161 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_160               1 1 161 162 0=96 1=5 11=5 12=1 13=2 14=2 2=1 3=2 4=2 5=1 6=2400 7=96
HardSwish                hswish_118               1 1 162 163 0=1.666667e-01 1=5.000000e-01
Convolution              conv_45                  1 1 163 164 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
HardSwish                hswish_119               1 1 164 165 0=1.666667e-01 1=5.000000e-01
Concat                   cat_8                    2 1 165 104 166 0=0
Split                    splitncnn_12             1 2 166 167 168
Convolution              conv_46                  1 1 168 169 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
HardSwish                hswish_120               1 1 169 170 0=1.666667e-01 1=5.000000e-01
Convolution              conv_47                  1 1 167 171 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
HardSwish                hswish_121               1 1 171 172 0=1.666667e-01 1=5.000000e-01
Convolution              conv_48                  1 1 172 173 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
HardSwish                hswish_122               1 1 173 174 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_161               1 1 174 175 0=48 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=1200 7=48
HardSwish                hswish_123               1 1 175 176 0=1.666667e-01 1=5.000000e-01
Convolution              conv_49                  1 1 176 177 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
HardSwish                hswish_124               1 1 177 178 0=1.666667e-01 1=5.000000e-01
Concat                   cat_9                    2 1 178 170 179 0=0
Convolution              conv_50                  1 1 179 180 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
HardSwish                hswish_125               1 1 180 181 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_162               1 1 181 182 0=96 1=5 11=5 12=1 13=2 14=2 2=1 3=2 4=2 5=1 6=2400 7=96
HardSwish                hswish_126               1 1 182 183 0=1.666667e-01 1=5.000000e-01
Convolution              conv_51                  1 1 183 184 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
HardSwish                hswish_127               1 1 184 185 0=1.666667e-01 1=5.000000e-01
Concat                   cat_10                   2 1 185 85 186 0=0
Split                    splitncnn_13             1 2 186 187 188
Convolution              conv_52                  1 1 188 189 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
HardSwish                hswish_128               1 1 189 190 0=1.666667e-01 1=5.000000e-01
Convolution              conv_53                  1 1 187 191 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
HardSwish                hswish_129               1 1 191 192 0=1.666667e-01 1=5.000000e-01
Convolution              conv_54                  1 1 192 193 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
HardSwish                hswish_130               1 1 193 194 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_163               1 1 194 195 0=48 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=1200 7=48
HardSwish                hswish_131               1 1 195 196 0=1.666667e-01 1=5.000000e-01
Convolution              conv_55                  1 1 196 197 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
HardSwish                hswish_132               1 1 197 198 0=1.666667e-01 1=5.000000e-01
Concat                   cat_11                   2 1 198 190 199 0=0
Convolution              conv_56                  1 1 199 200 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
HardSwish                hswish_133               1 1 200 201 0=1.666667e-01 1=5.000000e-01
Reshape                  reshape_141              1 1 201 202 0=256 1=96
Permute                  permute_138              1 1 202 out0 0=1
